s60sc/ESP32-CAM_MJPEG2SD/peripherals.cpp
void setLamp(uint8_t lampVal) {
  // control lamp status
  if (!lampUse) lampVal = 0;
  if (!externalPeripheral(lampPin, lampVal)) {
    if (!lampInit) setupLamp();
    if (lampInit) {
      if (PWMled) {
        // set lamp brightness using PWM (0 = off, 15 = max)
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
        lampWrite(lampPin, lampVal);
#else
        lampWrite(LAMP_LEDC_CHANNEL, lampVal);
#endif
      } else {
        // assume WS2812 LED - set white color and apply lampVal (0 = off, 15 = max)
        uint8_t RGB[3]; // each color is 8 bits
        lampVal = lampVal == 15 ? 255 : lampVal * 16;
        for (uint8_t i = 0; i < 3; i++) {
          RGB[i] = lampVal;
          // apply WS2812 bit encoding pulse timing per bit
          for (uint8_t j = 0; j < 8; j++) { 
            int bit = (i * 8) + j;
            if ((RGB[i] << j) & 0x80) { // get left most bit first
              // bit = 1
              ledData[bit].level0 = 1;
              ledData[bit].duration0 = 8;
              ledData[bit].level1 = 0;
              ledData[bit].duration1 = 4;
            } else {
              // bit = 0
              ledData[bit].level0 = 1;
              ledData[bit].duration0 = 4;
              ledData[bit].level1 = 0;
              ledData[bit].duration1 = 8;
            }
          }
        }
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
        rmtWrite(lampPin, ledData, RGB_BITS, RMT_WAIT_FOR_EVER);
#else
        rmtWrite(rmtWS2812, ledData, RGB_BITS);
#endif
      }
    }
  }
}

void twinkleLed(uint8_t ledPin, uint16_t interval, uint8_t blinks) {
  // twinkle led, for given number of blinks, 
  //  with given interval in ms between blinks
  bool ledState = true;
  for (int i=0; i<blinks*2; i++) {
    digitalWrite(ledPin, ledState);
    delay(interval);
    ledState = !ledState;
  }
}

void setLights(bool lightsOn) {
  // External on / off light
  if (lightsRCpin > 0) digitalWrite(lightsRCpin, lightsOn);
}

/********************* interact with UART **********************/

void setPeripheralResponse(const byte pinNum, const uint32_t responseData) {
  // callback for Client uart task 
  // updates peripheral stored input value when response received
  // map received pin number to peripheral
  LOG_VRB("Pin %d, data %u", pinNum, responseData);
  if (pinNum == pirPin) 
    memcpy(&pirVal, &responseData, sizeof(pirVal));  // set PIR status
  else if (pinNum == voltPin)
    memcpy(&currentVoltage, &responseData, sizeof(currentVoltage));  // set current batt voltage
  else if (pinNum == ds18b20Pin)
    memcpy(&dsTemp, &responseData, sizeof(dsTemp));  // set current temperature
  else if (pinNum == EXT_IO_PING) 
    extIOpinged = true;
  else if (pinNum != lampPin && pinNum != servoPanPin && pinNum != servoTiltPin) 
    LOG_WRN("Undefined pin number requested: %d ", pinNum);
}

uint32_t usePeripheral(const byte pinNum, const uint32_t receivedData) {
  // callback for IO Extender to interact with peripherals
  uint32_t responseData = 0;
  int ival;
  LOG_VRB("Pin %d, data %u", pinNum, receivedData);
  // map received pin number to peripheral
  if (pinNum == servoTiltPin) {
    // send tilt angle to servo
    memcpy(&ival, &receivedData, sizeof(ival)); 
    setCamTilt(ival);
  } else if (pinNum == servoPanPin) {
    // send pan angle to servo
    memcpy(&ival, &receivedData, sizeof(ival)); 
    setCamPan(ival);
  } else if (pinNum == pirPin) {
    // get PIR status
    bool bval = getPIRval();
    memcpy(&responseData, &bval, sizeof(bval)); 
  } else if (pinNum == lampPin) {
    // set Lamp status
    memcpy(&ival, &receivedData, sizeof(ival)); 
    setLamp(ival);
  } else if (pinNum == ds18b20Pin) {
    // get current temperature
    float fval = dsTemp;
    memcpy(&responseData, &fval, sizeof(fval)); 
  } else if (pinNum == voltPin) {
    // get current batt voltage
    float fval = currentVoltage;
    memcpy(&responseData, &fval, sizeof(fval)); 
  } else if (pinNum == (EXT_IO_PING - EXTPIN)) {
    LOG_INF("Received client ping");
  } else LOG_WRN("Undefined pin number requested: %d ", pinNum);
  return responseData;
}

static void prepPIR() {
  if ((pirPin < EXTPIN) && pirUse) {
    if (pirPin) pinMode(pirPin, INPUT_PULLDOWN); // pulled high for active
    else {
      pirUse = false;
      LOG_WRN("No PIR pin defined");
    }
  }
}


/*
MCPWM peripheral has 2 units, each unit can support:
- 3 pairs of PWM outputs (6 pins)
- 3 fault input pins to detect faults like overcurrent, overvoltage, etc.
- 3 sync input pins to synchronize output signals
- 3 input pins to gather feedback from controlled motors, using e.g. hall sensors

MX1508 DC Motor Driver with PWM Control
- 4 PWM gpio inputs, 2 per motor (forward & reverse)
- Two H-channel drive circuits for 2 DC motors 
- 1.5A (peak 2A)
- 2-10V DC input, 1.8-7V Dc output
- Outputs are OUT1 - OUT4 corresponding to IN1 to IN4
- IN1 / OUT1 A1
- IN2 / OUT2 B1
- IN3 / OUT3 A2
- IN4 / OUT4 B2
*/

////#include "driver/mcpwm_prelude.h" // v3.x
#define CONFIG_MCPWM_SUPPRESS_DEPRECATE_WARN true 
#include "driver/mcpwm.h" // v2.x

void prepMotors() {
#if !CONFIG_IDF_TARGET_ESP32C3
  if (RCactive) {
    if (motorFwdPin > 0) {
      // setup gpio pins used for motor (forward, optional reverse), and pwm frequency
      LOG_INF("initialising MCPWM, using pins %d, %d", motorFwdPin, motorRevPin);
      mcpwm_gpio_init(MCPWM_UNIT_0, MCPWM0A, motorFwdPin);
      if (motorRevPin > 0) mcpwm_gpio_init(MCPWM_UNIT_0, MCPWM0B, motorRevPin); 
      mcpwm_config_t pwm_config;
      pwm_config.frequency = pwmFreq;  // pwm frequency
      pwm_config.cmpr_a = 0;    // duty cycle of PWMxA
      pwm_config.cmpr_b = 0;    // duty cycle of PWMxb
      pwm_config.counter_mode = MCPWM_UP_COUNTER;
      pwm_config.duty_mode = MCPWM_DUTY_MODE_0;
      // Configure PWM0A & PWM0B with above settings
      mcpwm_init(MCPWM_UNIT_0, MCPWM_TIMER_0, &pwm_config); 
    } else LOG_WRN("RC motor pins not defined");
  }
#else
  RCactive = false;
  LOG_WRN("This function not compatible with ESP32-C3");
#endif
}

